import {ui} from "../../../ui/layaMaxUI";
import Browser = Laya.Browser;
import gameUI = ui.view.main.gameUI;
import { DataBase } from '../../../framework/manager/data/data-base';
import {MgrCenter} from "../../mgr/mgrCenter";
import {PlayerMgr} from "../../mgr/playerMgr/playerMgr";
import {MgrKey} from "../../sign/sign";

/**
 * @author Sun
 * @time 2019-08-11 18:08
 * @project SFramework_LayaAir
 * @description 主页
 *
 */
export class GameView extends gameUI {

    /*****************************************页面属性管理*****************************************/


    /********************************************——**********************************************/
    ////////////////////////////////////////////分界线////////////////////////////////////////////
    /*****************************************页面生命周期*****************************************/
    private static instance: GameView;

    public static get $(): GameView {
        if (!this.instance) this.instance = new GameView();
        return this.instance;
    }




    constructor() {
        super();
    }

    onAwake(): void {
        super.onAwake();
        this.Init();
        this.suitInit();
    }

    /**
     * 初始化一次
     */
    public Init() {

        this.initOnce();

        // //数据监听
        // this.addDataWatch(DataDefine.UserInfo);

        if (Browser.onWeiXin) {
            this.initLink();
        }
        MgrCenter.$.getMgr(MgrKey.PLAYER_MGR_KEY,PlayerMgr).bornPlayer();
    }

    /**
     * 每次弹出初始化一次
     */
    popupInit() {
        this.initAll();
    }


    /**
     * 适配
     */
    suitInit()
    {
    
    }


    /********************************************——**********************************************/
    ////////////////////////////////////////////分界线////////////////////////////////////////////
    /*****************************************页面初始数据*****************************************/

    /** Des:构造是初始化一次 */
    private initOnce()
    {
    }

    /** Des:每次弹出初始化 */
    private initAll()
    {

    }



    /********************************************——**********************************************/
    ////////////////////////////////////////////分界线////////////////////////////////////////////
    /***************************************外部连接进入判断***************************************/

    /** Des:判断进入连接信息 */
    private initLink() {


    }

    /********************************************——**********************************************/
    ////////////////////////////////////////////分界线////////////////////////////////////////////
    /*****************************************页面点击事件*****************************************/


 
    /********************************************——**********************************************/
    ////////////////////////////////////////////分界线////////////////////////////////////////////
    /****************************************数据改变的监听****************************************/

    /**
     * 刷新数据
     */
    protected onData(data: DataBase) {
        
    }


    /********************************************——**********************************************/
    ///////////////////////////////////////////-分界线-///////////////////////////////////////////

}

class Greeter {
    greeting: string;
    constructor(message: string) {
        this.greeting = message;
    }
    greet() {
        return "Hello, " + this.greeting;
    }
}


























